### BASE LAPTOP DEPENDENCIES ###

## BASE ##
brew 'awscli'
brew 'dep'
brew 'hugo'
# Text Editor
brew 'neovim'
# SECURITY
brew 'openssl'
# Pyenv dep
brew 'readline'
brew 'fzf'
brew 'jq'
# Searcher - faster grep
brew 'ripgrep'
brew 'tmux'
# Pyenv dep
brew 'watch'
brew 'xz'
brew 'watchman'
brew 'yarn'
# Please stop dumping weird ccc garbage from U2F
brew 'ykman'
# For oh-my-zsh
brew 'zsh'

## CASK ##
cask '1password'
cask 'alacritty'
cask 'android-studio'
# Git diff tool
cask 'diffmerge'
cask 'docker'
cask 'flux'
# Muh browsers
cask 'firefox'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'nordvpn'
cask 'postico'
# Window manager
cask 'phoenix'
cask 'slack'
cask 'spotify'
cask 'spotify-notifications'
cask 'vlc'

### LANGUAGES ###

## GO ##
brew 'go'

## NODE ##
brew 'node'

## PYTHON ##
brew 'pyenv'
brew 'pyenv-virtualenv'

## RUBY ##
brew 'rbenv'
