### BASE LAPTOP DEPENDENCIES ###

## BASE ##
# Text Editor
brew 'neovim'
# SECURITY
brew 'openssl'
# Pyenv dep
brew 'readline'
# Searcher - faster grep
brew 'ripgrep'
# Pyenv dep
brew 'watch'
brew 'xz'
# For oh-my-zsh
brew 'zsh'

## CASK ##
cask '1password'
# Git diff tool
cask 'diffmerge'
cask 'flux'
# Muh browsers
cask 'firefox'
cask 'google-chrome'
cask 'insomnia'
cask 'nordvpn'
cask 'postico'
# Window manager
cask 'phoenix'
cask 'slack'
cask 'spotify'
cask 'spotify-notifications'
cask 'vlc'

### LANGUAGES ###

## GO ##
brew 'go'

## NODE ##
brew 'node'

## PYTHON ##
brew 'pyenv'
brew 'pyenv-virtualenv'

## RUBY ##
brew 'rbenv'
